import { Component, OnInit } from '@angular/core';
@Component({
  selector: 'app-qustions',
  templateUrl: './qustions.component.html',
  styleUrls: ['./qustions.component.scss']
})
export class QustionsComponent implements OnInit {
  isCollapsed = false;
  showTextFlag = false
  answer: any;
  answers: any;
  showPlus: any
  index: number = 0;
  linebreak = '\n';
  constructor() { }
  questions = [
    {
      "question": "ماهي مساحة الحزام الأخضر 6 أكتوبر؟", "id": "1", "answer": " فدان1234567 ",
      "plusIcon": "fa-solid fa-plus", "munsIcon": "fa-solid fa-minus"

    },
    {
      "question": "ما هى جهة الولاية المختصة باراضى منطقة الحزام الاخضر 6 أكتوبر؟", "id": "1", "answer": "جهاز مدينة ٦ أكتوبرـ هيئة المجتمعات العمرانية الجديدة",
      "plusIcon": "fa-solid fa-plus", "munsIcon": "fa-solid fa-minus"
    },
    {
      "question": "ما هو الوضع القانونى لاراضى منطقة الحزام الاخضر 6 أكتوبر؟",
      "id": "2",
      "answer":
        ' تم التقنين من خلال عدة قرارات جمهورية و وزارية و تشمل'
        + ' ' + 'قرار جمهوري رقم 77 بتاريخ  07.02.2017 بضم 8336 فدان غرب  مدينة الشيخ زايد القديمة '
        + ' ' + 'قرار جمهوري رقم 230 بتاريخ 16.05.2017 بضم 2584 فدان شرق مدينة الشيخ زايد القديمة'
        + ' ' + 'لتتكون بذلك توسعات مدينة الشيخ زايد بمساحة قدرها 10920 فدان'
        + ' ' + 'علما بأن مساحة مدينة الشيخ زايد القديمة تبلغ 10600 فدان'
      ,
      "plusIcon": "fa-solid fa-plus", "munsIcon": "fa-solid fa-minus"
    },
    {
      "question": "تسلسل ملكية اراضى الحزام الاخضر 6 أكتوبر؟", "id": "2",
      "answer":
        ' اولا التعاقدات:'
        + ' ' + 'طرف اول: هيئة المجتمعات العمرانية الجديدة '
        + ' ' + 'طرف ثان: شركة 6 أكتوبر الزراعية لاستصلاح وتعمير وتنمية الاراضى (تخضع لهيئة الاستثمار)'
        + ' ' + '•	27.11.1997 	تم شراء 14021.23 فدان'
        + ' ' + '•	19.04.2008 	عقد بيع جديد لجزء من المساحة المتعاقد عليها بمساحة 10758 فدان'
        + ' ' + 'ثانيا مراحل التسليم:		 لمساحة اجماليها 15614.93 فدان'
        + ' ' + ' •	1995.11.14		2336.63 فدان'
        + ' ' + '•	2002.01.21		 10158  +3120.30 فدان  '
        + ' ' + 'ثالثا القرارات و التحركات:'
        + ' ' + '2009.04.26		قبول طلب تسجيل شهر عقارى'
        + ' ' + '2010.10.14		الموافقة على رفع نسبة المبانى الى ٧٪'
        + ' ' + ' 2011.07.09		سحب 3120 فدان '
        + ' ' + '2012.07.11		لجنة معاينة لاثبات الجدية (قرار بعدم الجدية لمساحة 12494 فدان خلال يومين فقط)'
        + ' ' + '2012.08.14		قرار بسحب باقى مساحة الحزام الاخضر 12494 فدان'
        + ' ' + '2014.09.25		سحب بالقوة (دون حكم قضائي) لمساحة 3120 فدان'
        + ' ' + '2014.10.13		قرار بتجميد اى اجراأت على الارض من الهيئة العامة للاستثمار'
        + ' ' + '2014.11.23		خطاب تأكيد لتجميد الوضع من جهاز ٦ اكتوبر'
        + ' ' + '2016.02.25		كسر قرار التجميد و البدء فى بناء وحدات سكنية على مساحة 3120 فدان',
      "plusIcon": "fa-solid fa-plus", "munsIcon": "fa-solid fa-minus"
    },
    {
      "question": "ما هى الانشطة و نسب البناء و الارتفاعات و الكثافة السكانية آلمسموح بها بالمنطقة؟", "id": "2", "answer":
        'الانشطة هى اسكان فاخر مع امكانية تحويل النشاط الى خدمى مقابل دفع رسوم اضافية تحددها الهيئة'
        + ' ' + 'نسب البناء 15%'
        + ' ' + 'بدروم + ارضى + علوى + روف يمثل 25% من مساحة الدور الارضى'
        + ' ' + 'الكثافة السكانية هى 45 شخص للفدان'
        + ' ' + 'اى فى انه حالة فدان واحد يتم ضرب'
        + ' ' + '1x45'
        + '' + 'ثم يقسم الناتج على 4.3 و هو عدد الافراد المفترض ان يشغلوا كل وحدة سكنية',
      "plusIcon": "fa-solid fa-plus", "munsIcon": "fa-solid fa-minus"
    },
    {
      "question": "ما هى الردود المسوح بها ؟", "id": "2", "answer": '4 متر امامى'
        + ' ' + '6 متر خلفى'
        + ' ' + '3 متر جانبي'
        + ' ' + 'الردود الخارجية مع الطرق 6 متر',
      "plusIcon": "fa-solid fa-plus", "munsIcon": "fa-solid fa-minus"
    },
    {
      "question": "ما هى قواعد انشاء اسوار تحيط بالمشروع ؟", "id": "2", "answer":
        ' تم وضع ضوابط لشكل الاسوار في الحزام عباره ن سمل خرساني او طوب بارتفاع 50 سم يعلوه مصبعات من الخشب او الحديد و يمكن كسو هذه المصبعات بزراعات'
        + ' ' + 'و بيتم تجليد السمل باحجار طبيعيه او طوب فرعوني او اي تجليد يعطى الشكل الجمالى المطلوب'
      ,
      "plusIcon": "fa-solid fa-plus", "munsIcon": "fa-solid fa-minus"
    },
    {
      "question": "فى حالة تغيير النشاط الى خدمى ما هى نسب البناء المسموح بها و ما هى رسوم التغيير؟", "id": "2", "answer":
        'يحق للمالك تغيير النشاط جزءيا على مساحة 12% من اجمالى مساحة القطعة و يسمح بالبناء على 30% من 12ا%'
        + ' ' + 'و يتم تحصيل رسوم اضافية تتراوح ما بين 2500 الى 3000 جنيه مصرى عن كل متر مربع من المساحة الخدمية'
      , "plusIcon": "fa-solid fa-plus", "munsIcon": "fa-solid fa-minus"
    },
    {
      "question": "ما هو العرض المقرر للشوارع الداخلية و الارصفة ؟", "id": "2", "answer":
        ' عرض الشارع الاتجاهين 9 متر + 2 متر رصيف لكل جانب'
        + ' ' + 'فى حالة وجود فيلات على جانب واحد فقط يكون الرصيف الملاصق للسور 1 متر '
        + ' ' + 'فى حالة شارع اتجاه واحد يكون العرض 7 متر على اقل تقدير'
      , "plusIcon": "fa-solid fa-plus", "munsIcon": "fa-solid fa-minus"
    },
    {
      "question": "ما قيمة رسوم القرار الوزارى و تكلفته الاجمالية؟", "id": "2", "answer":
        '17200 جنيه هى قيمة رسوم القرار الوزارى عن كل فدان تسدد لهيئة المجتمعات العمرانية الجديدة'
        + ' ' + 'يضاف اليها اتعاب المكتب الهندسى لعمل التصميمات الهندسية '
        + ' ' + 'و يستغرق استخراج القرار قرابة شهرين. '
      , "plusIcon": "fa-solid fa-plus", "munsIcon": "fa-solid fa-minus"
    },
  ]
  activeState: boolean[] = [true, false, false];
  toggle(index: number) {
    this.activeState[index] = !this.activeState[index];
  }
  ngOnInit(): void {
  }
}
